OAT15_simulations/OAT15_URANS_kOmegaSST_z1_pitching/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
    limited         cellLimited Gauss linear 1;
    grad(U)         $limited;
    grad(p)         $limited;
    grad(e)         $limited;
    grad(nuTilda)   $limited;
    grad(K)         $limited;
    grad(Phi)       cellLimited leastSquares 1;
    grad(k)         $limited;
    grad(omega)     $limited;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss limitedLinear 1;

    turbulence       Gauss limitedLinear 1;
    div(phi,nuTilda) $turbulence;

    energy          Gauss limitedLinear 1;
    div(phi,e)      $energy;
    div(phi,K)      $energy;
    div(phi,Ekp)    $energy;

    div(phi,k)       Gauss limitedLinear 1.0;
    div(phi,omega)   Gauss limitedLinear 1.0;

    div(phiv,p)     Gauss limitedLinear 1;
    div(phid,p)     Gauss limitedLinear 1;

    div(((rho*nuEff)*dev2(T(grad(U)))))    Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
    laplacian(diffusivity,cellDisplacement) Gauss linear corrected; 
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
